/**
 ******************************************************************************
 * @file    sl_config
 * @author  sloop
 * @date    2024-12-18
 * @brief   在此处配置 sloop 和启用功能模块
 * ==此文件用户可配置==
 *****************************************************************************/

#ifndef __sl_config_H
#define __sl_config_H

/* 并行任务上限 */
#define SL_PARALLEL_LIMIT 32

/* ============================================================== */

/* 启用RTT打印 */
#define SL_RTT_ENABLE 1

/* RTT 打印缓冲区大小 */
#define SL_RTT_BUFFER_SIZE 2048

#endif /* __sl_config_H */

/************************** END OF FILE **************************/
